// 旗の状態を指示する指示文の一覧
const FLAG_ORDER_TEXT_STATE = [
    // レベル1
    [
        "上げて",
        "上げないで",
        "下げて",
        "下げないで",
    ],
    // レベル2
    [
        "動かして",
        "キープして",
        "もう一方にそろえて",
        "もう一方とそろえないで"
    ],
    // レベル3
    [
        "好きなようにして",
        ""
    ]
];

// 旗の色を指示する指示文の一覧
const FLAG_ORDER_TEXT_COLOR = [
    // レベル1
    [
        "白",
        "しろ",
        "赤",
        "あか"
    ],
    // レベル2
    [
        "赤じゃない方",
        "赤以外",
        "白じゃない方",
        "白以外"
    ],
    // レベル3
    [
        "白じゃない方じゃない方",
        "赤じゃない方じゃない方",
        "好きな方"
    ]
];
